ONVIF/GetServices-auth.xml

<?xml version='1.0' encoding='utf-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
	<SOAP-ENV:Body>
		<tds:GetServices>
			<tds:IncludeCapability>false</tds:IncludeCapability>
		</tds:GetServices>
	</SOAP-ENV:Body>
	<SOAP-ENV:Header>
		<Security SOAP-ENV:mustUnderstand="1" xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<UsernameToken>
				<Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2022-11-22T11:09:55.000Z</Created>
				<Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">M+8w+/2rgESSmu7/bPOle73ZcSU=</Nonce>
				<Username/>
				<Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">2rXz5WcSxs3d0jPuihD6UjvJgCY=</Password>
			</UsernameToken>
		</Security>
	</SOAP-ENV:Header>
</SOAP-ENV:Envelope>
