manual_testing/data/GetServices.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>admin</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">jNVDvrHgQWoia/3GDRt79Ba5fKY=</wsse:Password>
				<wsse:Nonce>uY9+9uYgE7cz5knujgr5Vg==</wsse:Nonce>
				<wsu:Created>2022-03-07T13:19:38Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</s:Header>
	<s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		<GetServices xmlns="http://www.onvif.org/ver10/device/wsdl">
			<IncludeCapability>false</IncludeCapability>
		</GetServices>
	</s:Body>
</s:Envelope>