doc/device_info_send.xml

POST /onvif/device_service HTTP/1.1
Host: 192.168.151.165
User-Agent: gSOAP/2.8
Content-Type: application/soap+xml; charset=utf-8; action="http://www.onvif.org/ver10/device/wsdl/GetDeviceInformation"
Content-Length: 1563
Connection: close
SOAPAction: "http://www.onvif.org/ver10/device/wsdl/GetDeviceInformation"

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope 
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" 
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#" 
    xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion" 
    xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" 
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
    xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" 
    xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" 
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" 
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery" 
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex" 
    xmlns:wsa5="http://www.w3.org/2005/08/addressing" 
    xmlns:xmime="http://tempuri.org/xmime.xsd" 
    xmlns:xop="http://www.w3.org/2004/08/xop/include" 
    xmlns:tt="http://www.onvif.org/ver10/schema" 
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2" 
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" 
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" 
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl" 
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl" 
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
<SOAP-ENV:Body>
    <tds:GetDeviceInformation></tds:GetDeviceInformation>
    </SOAP-ENV:Body>
    </SOAP-ENV:Envelope>
